tap "homebrew/bundle"
tap "manaflow-ai/cmux"

brew "git"
brew "gnupg"
brew "mise"
brew "nkf"
brew "nmap"
brew "tree"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"

cask_args appdir: "/Applications"

cask "1password"
cask "cmux"
cask "emdash"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "iterm2"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "zed"

vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
